from aiogram.types import KeyboardButton, ReplyKeyboardMarkup



class Kb:
    def __init__(self, *args):
        self.titles = list(args)

    def make_keyboard(self):
        buttons = []
        for title in self.titles:
            buttons.append([KeyboardButton(text = title)])
        kb = ReplyKeyboardMarkup(resize_keyboard=True, keyboard=buttons) 
        return kb


choose_diametr = Kb("МЦД-1", "МЦД-2", "МЦД-3", "МЦД-4").make_keyboard()
diametr1 = Kb("Лобня", "Шереметьевская", "Хлебниково", "Водниково", "Долгопрудная", "Новодачная", "Марк", "Лианозово", "Бескудниково", "Дегунино", "Окружная", "Петровско-разумовская", "Тимирязевская", "Дмитровская", "Савеловский вокзал", "Белорусский вокзал", "Беговая", "Тестовская", "Фили", "Славянский бульвар", "Кунцево", "Рабочий поселок", "Сетунь", "Немчиновка", "Сколково", "Баковка (строится)", "Одинцово").make_keyboard()
diametr2 = Kb("Подольск", "Силикатная", "Остафьево", "Щербинка", "Бутово", "Битца", "Красный строитель", "Покровская", "Котляково", "Царицыно", "Москворечье", "Курьяново", "Перерва", "Депо", "Люблино", "Печатники", "Текстильщики", "Новохохловская", "Калитники", "Москва-Товарная", "Курский вокзал", "Каланчевская", "Ржевская", "Марьина роща", "Дмитровская", "Гражданская", "Красный балтиец", "Стрешнево", "Щукинская", "Тушино", "Трикотажная", "Волоколамская", "Пенягино", "Павшино", "Красногорская", "Опалиха", "Аникеевка", "Нахабино").make_keyboard()
diametr3 = Kb("Зеленоград", "Фирсановская", "Сходня", "Подрезково", "Новоподрезково", "Молжаниново", "Химки", "Левобережная", "Ховрино", "Грачевская", "Моссельмаш", "Лихоборы", "Петровско-Разумовская", "Останкино", "Электрозаводская", "Авиамоторная", "Андроновка", "Перово", "Плющево", "Вешняки", "Выхино", "Косино", "Ухтомская", "Люберцы", "Панки", "Томилино", "Красково", "Малаховка", "Удельная", "Быково", "Ильинская", "Отдых", "Кратово", "Есенинская", "Фабричная", "Раменское", "Ипподром").make_keyboard()
diametr4 = Kb("Апрелевка", "Победа", "Крекшино", "Санино", "Кокошкино", "Толстопальцево", "Лесной городок", "Внуково", "Мичуринец", "Переделкино", "Новопеределкино", "Солнечная", "Мещерская", "Очаково", "Аминьевская", "Матвеевская", "Минская", "Поклонная", "Кутузовская", "Тестовская", "Беговая", "Белорусская", "Савеловская", "Марьина Роща", "Рижская", "Площадь трех вокзалов", "Курская", "Серп и Молот", "Нижегородская", "Чухлинка", "Кусково", "Новогиреево", "Реутов", "Никольское", "Салтыковская", "Кучино", "Железнодорожная").make_keyboard()